mysqldump: [Warning] Using a password on the command line interface can be insecure.
-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: ecommerce_db
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '自增ID',
  `username` varchar(50) NOT NULL COMMENT '用户名',
  `product_id` varchar(50) NOT NULL COMMENT '商品ID',
  `product_name` varchar(100) NOT NULL COMMENT '商品名称',
  `icon` varchar(10) DEFAULT NULL COMMENT '商品图标',
  `price` decimal(10,2) NOT NULL COMMENT '商品单价',
  `quantity` int NOT NULL DEFAULT '1' COMMENT '购买数量',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_user_product` (`username`,`product_id`) COMMENT '用户+商品唯一',
  KEY `idx_username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='购物车表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_items`
--

DROP TABLE IF EXISTS `order_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_items` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '自增ID',
  `order_id` varchar(100) NOT NULL COMMENT '订单ID',
  `product_id` varchar(50) NOT NULL COMMENT '商品ID',
  `product_name` varchar(100) NOT NULL COMMENT '商品名称',
  `icon` varchar(10) DEFAULT NULL COMMENT '商品图标',
  `price` decimal(10,2) NOT NULL COMMENT '商品单价',
  `quantity` int NOT NULL COMMENT '购买数量',
  PRIMARY KEY (`id`),
  KEY `idx_order_id` (`order_id`),
  CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='订单详情表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_items`
--

LOCK TABLES `order_items` WRITE;
/*!40000 ALTER TABLE `order_items` DISABLE KEYS */;
INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `product_name`, `icon`, `price`, `quantity`) VALUES (1,'ORD1779352557157','P001','智能手机','📱',2999.00,1),(2,'ORD1779352557157','P003','充电宝','🔋',99.00,1),(3,'ORD1779352557157','S002','篮球','🏀',149.00,1),(4,'ORD1779352557157','S003','哑铃','🏋️',199.00,1),(5,'ORD1779355040842','P001','智能手机','📱',2999.00,1),(6,'ORD1779355379552','CL001','T恤','👕',99.00,1),(7,'ORD1779355379552','CL002','牛仔裤','👖',199.00,1),(8,'ORD1779355379552','P001','智能手机','📱',2999.00,1),(9,'ORD1779355379552','P002','5G手机','📲',3599.00,1),(10,'ORD1779356162769','P001','智能手机','📱',2999.00,1),(11,'ORD1779356841971','CL001','T恤','👕',99.00,2),(12,'ORD1779358028324','C001','笔记本电脑','💻',4599.00,1),(13,'ORD1779358233546','P002','5G手机','📲',3599.00,1),(14,'ORD1779360937520','P001','智能手机','📱',2999.00,1),(15,'ORD1779371391516','P002','5G手机','📲',3599.00,1),(16,'ORD1779427426114','BA001','玩具熊','🧸',89.00,1),(17,'ORD1779427426114','BE001','口红','💄',199.00,1),(18,'ORD1779427426114','P001','智能手机','',2999.00,1),(19,'ORD1779427426114','S001','足球','⚽',129.00,1),(20,'ORD1779427812661','P001','智能手机','',2999.00,1),(21,'ORD1779428561845','P002','5G手机','📲',3599.00,1),(22,'ORD1779502799410','F001','苹果','🍎',29.00,1),(23,'ORD1779502799410','F002','面包','🍞',15.00,1),(24,'ORD1779502799410','F003','咖啡','☕',68.00,1),(25,'ORD1779595546791','P001','智能手机','',2999.00,2),(26,'ORD1779595546791','CL002','牛仔裤','👖',199.00,1),(27,'ORD1779595546791','CL003','运动鞋','👟',399.00,1),(28,'ORD1779595546791','CL001','T恤','👕',99.00,1),(29,'ORD1779595546791','B001','编程书籍','📚',79.00,1),(30,'ORD1779595546791','B002','小说','📖',45.00,1),(31,'ORD1779595546791','B003','文具套装','✏️',39.00,1),(32,'ORD1779595546791','P002','5G手机','📲',3599.00,1),(33,'ORD1779595546791','P003','充电宝','🔋',99.00,1),(34,'ORD1779789579234','C001','笔记本电脑','💻',4599.00,1),(35,'ORD1779789579234','CL001','T恤','👕',99.00,1),(36,'ORD1779789579234','P001','智能手机','📱',2999.00,1),(37,'ORD1779789579234','P002','5G手机','📲',3599.00,1),(38,'ORD1780098463795','BA001','玩具熊','🧸',89.00,6),(39,'ORD1780100121401','P001','智能手机','📱',2999.00,3),(40,'ORD1780100121401','S001','足球','⚽',129.00,3),(41,'ORD1780100121401','S002','篮球','🏀',149.00,3);
/*!40000 ALTER TABLE `order_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `id` varchar(100) NOT NULL COMMENT '订单ID',
  `username` varchar(50) NOT NULL COMMENT '用户名',
  `total_amount` decimal(10,2) NOT NULL COMMENT '订单总金额',
  `status` varchar(20) DEFAULT '待发货' COMMENT '订单状态',
  `order_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '下单时间',
  PRIMARY KEY (`id`),
  KEY `idx_username` (`username`),
  KEY `idx_order_time` (`order_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='订单表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` (`id`, `username`, `total_amount`, `status`, `order_time`) VALUES ('ORD1779352557157','admin',3446.00,'待发货','2026-05-21 08:35:57'),('ORD1779355040842','admin',2999.00,'待发货','2026-05-21 09:17:20'),('ORD1779355379552','admin',6896.00,'待发货','2026-05-21 09:22:59'),('ORD1779356162769','admin',2999.00,'待发货','2026-05-21 09:36:02'),('ORD1779356841971','admin',198.00,'待发货','2026-05-21 09:47:21'),('ORD1779358028324','admin',4599.00,'待发货','2026-05-21 10:07:08'),('ORD1779358233546','admin',3599.00,'待发货','2026-05-21 10:10:33'),('ORD1779360937520','admin',2999.00,'待发货','2026-05-21 10:55:37'),('ORD1779371391516','admin',3599.00,'待发货','2026-05-21 13:49:51'),('ORD1779427426114','admin',3416.00,'已发货','2026-05-22 05:23:46'),('ORD1779427812661','admin',2999.00,'已发货','2026-05-22 05:30:12'),('ORD1779428561845','admin',3599.00,'已发货','2026-05-22 05:42:41'),('ORD1779502799410','user3',112.00,'已发货','2026-05-23 02:19:59'),('ORD1779595546791','admin',10556.00,'已发货','2026-05-24 04:05:46'),('ORD1779789579234','admin',11296.00,'已发货','2026-05-26 09:59:39'),('ORD1780098463795','admin',534.00,'已发货','2026-05-29 23:47:43'),('ORD1780100121401','admin',9831.00,'待发货','2026-05-30 00:15:21');
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product_reviews`
--

DROP TABLE IF EXISTS `product_reviews`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_reviews` (
  `id` int NOT NULL AUTO_INCREMENT,
  `product_id` varchar(50) NOT NULL,
  `username` varchar(50) NOT NULL,
  `rating` int NOT NULL,
  `content` text,
  `review_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_product_id` (`product_id`),
  KEY `idx_username` (`username`),
  CONSTRAINT `product_reviews_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=160 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_reviews`
--

LOCK TABLES `product_reviews` WRITE;
/*!40000 ALTER TABLE `product_reviews` DISABLE KEYS */;
INSERT INTO `product_reviews` (`id`, `product_id`, `username`, `rating`, `content`, `review_time`) VALUES (10,'P001','admin',5,'非常好用的手机，运行流畅，拍照清晰，性价比很高！','2026-05-17 04:43:04'),(13,'P002','admin',5,'5G速度真的快，屏幕显示效果很好，推荐购买！','2026-05-15 04:43:04'),(14,'P002','user2',4,'性能强劲，拍照效果好，就是价格有点贵','2026-05-18 04:43:04'),(15,'P003','admin2',5,'容量大，充电速度快，出差必备！','2026-05-16 04:43:04'),(16,'P003','user1',4,'轻便实用，就是有点发热','2026-05-20 04:43:04'),(17,'P003','user3',5,'性价比很高，值得购买！','2026-05-21 04:43:04'),(18,'C001','admin',4,'性能强劲，办公游戏都没问题，就是有点重','2026-05-12 04:43:04'),(19,'C001','admin2',5,'非常满意，散热好，键盘手感不错','2026-05-14 04:43:04'),(20,'C001','user2',4,'运行速度快，屏幕清晰，适合办公','2026-05-19 04:43:04'),(21,'C002','user1',5,'画质清晰，色彩还原度高，设计办公都很棒！','2026-05-17 04:44:52'),(22,'C002','user3',4,'尺寸合适，显示效果好，就是支架有点简陋','2026-05-20 04:44:52'),(23,'C003','admin',5,'手感极佳，打字舒服，RGB灯效很漂亮！','2026-05-15 04:44:52'),(24,'C003','user2',5,'轴体手感好，做工精细，值得拥有！','2026-05-18 04:44:52'),(25,'C003','user1',4,'敲击声音适中，适合办公使用','2026-05-21 04:44:52'),(26,'H001','admin',5,'很舒服的沙发，质量很好，物流也快！','2026-05-20 04:44:52'),(27,'H001','user3',4,'款式好看，坐着舒适，就是味道有点大','2026-05-21 04:44:52'),(28,'H002','user1',5,'软硬适中，睡眠质量提高了很多！','2026-05-16 04:44:52'),(29,'H002','admin2',5,'质量很好，没有异味，睡得很舒服','2026-05-19 04:44:52'),(30,'H002','user2',4,'支撑性好，就是价格稍贵','2026-05-21 04:44:52'),(31,'H003','user3',5,'智能控制很方便，可以调节亮度和色温！','2026-05-18 04:44:52'),(32,'H003','user1',4,'连接稳定，APP操作简单，性价比高','2026-05-20 04:44:52'),(33,'CL001','admin',5,'面料舒适，版型好看，洗了不变形！','2026-05-17 04:44:52'),(34,'CL001','user2',4,'颜色正，穿着舒服，就是尺码偏大','2026-05-20 04:44:52'),(35,'CL001','user3',5,'物美价廉，已经回购了！','2026-05-21 04:44:52'),(36,'CL002','user1',4,'版型好，面料有弹性，穿着舒适','2026-05-16 04:44:52'),(37,'CL002','admin2',5,'质量很好，做工精细，值得购买！','2026-05-19 04:44:52'),(38,'CL003','user3',5,'轻便舒适，跑步很合适，防滑效果好！','2026-05-18 04:44:52'),(39,'CL003','user2',4,'外观时尚，穿着舒服，就是码数偏小','2026-05-21 04:44:52'),(40,'CL003','admin',5,'减震效果好，运动必备！','2026-05-20 04:44:52'),(41,'F001','admin',4,'苹果很新鲜，甜度适中，就是数量有点少','2026-05-21 04:44:52'),(42,'F001','admin2',5,'非常好吃，物美价廉！','2026-05-18 04:44:52'),(43,'F001','user1',5,'口感脆甜，物流快，包装好！','2026-05-20 04:44:52'),(44,'F002','user3',5,'新鲜好吃，早餐必备，口感松软！','2026-05-19 04:44:52'),(45,'F002','user2',4,'味道不错，就是保质期有点短','2026-05-21 04:44:52'),(46,'F003','admin',5,'香浓可口，提神醒脑，品质很好！','2026-05-17 04:44:52'),(47,'F003','user1',4,'味道纯正，性价比不错','2026-05-20 04:44:52'),(48,'F003','admin2',5,'每天早上必喝，非常满意！','2026-05-21 04:44:52'),(49,'B001','admin',5,'内容很实用，讲解详细，适合初学者','2026-05-16 04:44:52'),(50,'B001','user3',4,'知识点全面，案例丰富，值得学习','2026-05-19 04:44:52'),(51,'B002','user2',5,'情节精彩，文笔优美，一看就停不下来！','2026-05-18 04:44:52'),(52,'B002','user1',4,'故事吸引人，就是结局有点仓促','2026-05-21 04:44:52'),(53,'B002','admin2',5,'非常好看，已经推荐给朋友了！','2026-05-20 04:44:52'),(54,'B003','user3',5,'种类齐全，质量不错，学生必备！','2026-05-17 04:44:52'),(55,'B003','user2',4,'包装精美，实用性强','2026-05-20 04:44:52'),(56,'S001','admin2',4,'质量不错，踢起来手感好','2026-05-13 04:44:52'),(57,'S001','user1',5,'弹性好，耐用，适合训练和比赛！','2026-05-18 04:44:52'),(58,'S001','user3',4,'做工精细，就是价格稍贵','2026-05-21 04:44:52'),(59,'S002','user2',5,'手感极佳，运球稳定，投篮准确！','2026-05-16 04:44:52'),(60,'S002','admin',4,'质量很好，耐磨性强','2026-05-20 04:44:52'),(61,'S003','user1',5,'重量准确，握感舒适，健身必备！','2026-05-17 04:44:52'),(62,'S003','user3',4,'做工精细，就是有点占地方','2026-05-20 04:44:52'),(63,'S003','admin2',5,'质量很好，在家锻炼很方便！','2026-05-21 04:44:52'),(64,'BE001','user2',5,'颜色好看，持久不脱色，质地滋润！','2026-05-18 04:44:52'),(65,'BE001','admin',4,'包装精美，上色均匀','2026-05-21 04:44:52'),(66,'BE001','user1',5,'非常满意，已经回购了！','2026-05-20 04:44:52'),(67,'BE002','user3',5,'补水效果好，皮肤变得水润有光泽！','2026-05-16 04:44:52'),(68,'BE002','admin2',4,'温和不刺激，适合敏感肌','2026-05-19 04:44:52'),(69,'BE003','user1',4,'颜色漂亮，易涂抹，就是干得有点慢','2026-05-17 04:44:52'),(70,'BE003','user2',5,'持久度好，不掉色，很满意！','2026-05-20 04:44:52'),(71,'BE003','user3',4,'性价比高，颜色选择多','2026-05-21 04:44:52'),(72,'BA001','admin',5,'毛绒柔软，孩子很喜欢，质量不错！','2026-05-15 04:44:52'),(73,'BA001','user1',4,'造型可爱，做工精细','2026-05-19 04:44:52'),(74,'BA002','admin2',5,'材质安全，防胀气效果好，宝宝喜欢！','2026-05-17 04:44:52'),(75,'BA002','user3',4,'清洗方便，刻度清晰','2026-05-20 04:44:52'),(76,'BA002','user2',5,'质量很好，性价比高！','2026-05-21 04:44:52'),(77,'BA003','user1',5,'面料柔软舒适，宝宝穿着很合适！','2026-05-16 04:44:52'),(78,'BA003','admin',4,'款式可爱，做工精细，就是尺码偏小','2026-05-20 04:44:52'),(79,'HW001','user3',5,'种类齐全，质量好，家用必备！','2026-05-18 04:44:52'),(80,'HW001','user2',4,'做工精细，耐用性强','2026-05-21 04:44:52'),(81,'HW001','admin2',5,'性价比很高，非常满意！','2026-05-20 04:44:52'),(82,'HW002','user1',5,'动力强劲，操作简单，很实用！','2026-05-17 04:44:52'),(83,'HW002','admin',4,'噪音小，续航时间长','2026-05-20 04:44:52'),(84,'HW003','user3',4,'重量适中，握感舒适，质量好','2026-05-16 04:44:52'),(85,'HW003','user2',5,'结实耐用，性价比不错！','2026-05-19 04:44:52'),(86,'HW003','admin2',4,'做工精细，家用很合适','2026-05-21 04:44:52'),(87,'P001','admin',4,'很好用','2026-05-22 05:47:51'),(88,'P001','admin',3,'还行吧','2026-05-22 05:48:04'),(89,'P002','admin',3,'还行吧','2026-05-23 02:05:57'),(92,'C002','user1',5,'画质清晰，色彩还原度高，设计办公都很棒！','2026-05-22 09:07:15'),(93,'C002','user3',4,'尺寸合适，显示效果好，就是支架有点简陋','2026-05-25 09:07:15'),(94,'C003','admin',5,'手感极佳，打字舒服，RGB灯效很漂亮！','2026-05-20 09:07:15'),(95,'C003','user2',5,'轴体手感好，做工精细，值得拥有！','2026-05-23 09:07:15'),(96,'C003','user1',4,'敲击声音适中，适合办公使用','2026-05-26 09:07:15'),(97,'H001','admin',5,'很舒服的沙发，质量很好，物流也快！','2026-05-25 09:07:15'),(98,'H001','user3',4,'款式好看，坐着舒适，就是味道有点大','2026-05-26 09:07:15'),(99,'H002','user1',5,'软硬适中，睡眠质量提高了很多！','2026-05-21 09:07:15'),(100,'H002','admin2',5,'质量很好，没有异味，睡得很舒服','2026-05-24 09:07:15'),(101,'H002','user2',4,'支撑性好，就是价格稍贵','2026-05-26 09:07:15'),(102,'H003','user3',5,'智能控制很方便，可以调节亮度和色温！','2026-05-23 09:07:15'),(103,'H003','user1',4,'连接稳定，APP操作简单，性价比高','2026-05-25 09:07:15'),(104,'CL001','admin',5,'面料舒适，版型好看，洗了不变形！','2026-05-22 09:07:15'),(105,'CL001','user2',4,'颜色正，穿着舒服，就是尺码偏大','2026-05-25 09:07:15'),(106,'CL001','user3',5,'物美价廉，已经回购了！','2026-05-26 09:07:15'),(107,'CL002','user1',4,'版型好，面料有弹性，穿着舒适','2026-05-21 09:07:15'),(108,'CL002','admin2',5,'质量很好，做工精细，值得购买！','2026-05-24 09:07:15'),(109,'CL003','user3',5,'轻便舒适，跑步很合适，防滑效果好！','2026-05-23 09:07:15'),(110,'CL003','user2',4,'外观时尚，穿着舒服，就是码数偏小','2026-05-26 09:07:15'),(111,'CL003','admin',5,'减震效果好，运动必备！','2026-05-25 09:07:15'),(112,'F001','admin',4,'苹果很新鲜，甜度适中，就是数量有点少','2026-05-26 09:07:15'),(113,'F001','admin2',5,'非常好吃，物美价廉！','2026-05-23 09:07:15'),(114,'F001','user1',5,'口感脆甜，物流快，包装好！','2026-05-25 09:07:15'),(115,'F002','user3',5,'新鲜好吃，早餐必备，口感松软！','2026-05-24 09:07:15'),(116,'F002','user2',4,'味道不错，就是保质期有点短','2026-05-26 09:07:15'),(117,'F003','admin',5,'香浓可口，提神醒脑，品质很好！','2026-05-22 09:07:15'),(118,'F003','user1',4,'味道纯正，性价比不错','2026-05-25 09:07:15'),(119,'F003','admin2',5,'每天早上必喝，非常满意！','2026-05-26 09:07:15'),(120,'B001','admin',5,'内容很实用，讲解详细，适合初学者','2026-05-21 09:07:15'),(121,'B001','user3',4,'知识点全面，案例丰富，值得学习','2026-05-24 09:07:15'),(122,'B002','user2',5,'情节精彩，文笔优美，一看就停不下来！','2026-05-23 09:07:15'),(123,'B002','user1',4,'故事吸引人，就是结局有点仓促','2026-05-26 09:07:15'),(124,'B002','admin2',5,'非常好看，已经推荐给朋友了！','2026-05-25 09:07:15'),(125,'B003','user3',5,'种类齐全，质量不错，学生必备！','2026-05-22 09:07:15'),(126,'B003','user2',4,'包装精美，实用性强','2026-05-25 09:07:15'),(127,'S001','admin2',4,'质量不错，踢起来手感好','2026-05-18 09:07:15'),(128,'S001','user1',5,'弹性好，耐用，适合训练和比赛！','2026-05-23 09:07:15'),(129,'S001','user3',4,'做工精细，就是价格稍贵','2026-05-26 09:07:15'),(130,'S002','user2',5,'手感极佳，运球稳定，投篮准确！','2026-05-21 09:07:15'),(131,'S002','admin',4,'质量很好，耐磨性强','2026-05-25 09:07:15'),(132,'S003','user1',5,'重量准确，握感舒适，健身必备！','2026-05-22 09:07:15'),(133,'S003','user3',4,'做工精细，就是有点占地方','2026-05-25 09:07:15'),(134,'S003','admin2',5,'质量很好，在家锻炼很方便！','2026-05-26 09:07:15'),(135,'BE001','user2',5,'颜色好看，持久不脱色，质地滋润！','2026-05-23 09:07:15'),(136,'BE001','admin',4,'包装精美，上色均匀','2026-05-26 09:07:15'),(137,'BE001','user1',5,'非常满意，已经回购了！','2026-05-25 09:07:15'),(138,'BE002','user3',5,'补水效果好，皮肤变得水润有光泽！','2026-05-21 09:07:15'),(139,'BE002','admin2',4,'温和不刺激，适合敏感肌','2026-05-24 09:07:15'),(140,'BE003','user1',4,'颜色漂亮，易涂抹，就是干得有点慢','2026-05-22 09:07:15'),(141,'BE003','user2',5,'持久度好，不掉色，很满意！','2026-05-25 09:07:15'),(142,'BE003','user3',4,'性价比高，颜色选择多','2026-05-26 09:07:15'),(143,'BA001','admin',5,'毛绒柔软，孩子很喜欢，质量不错！','2026-05-20 09:07:15'),(144,'BA001','user1',4,'造型可爱，做工精细','2026-05-24 09:07:15'),(145,'BA002','admin2',5,'材质安全，防胀气效果好，宝宝喜欢！','2026-05-22 09:07:15'),(146,'BA002','user3',4,'清洗方便，刻度清晰','2026-05-25 09:07:15'),(147,'BA002','user2',5,'质量很好，性价比高！','2026-05-26 09:07:15'),(148,'BA003','user1',5,'面料柔软舒适，宝宝穿着很合适！','2026-05-21 09:07:15'),(149,'BA003','admin',4,'款式可爱，做工精细，就是尺码偏小','2026-05-25 09:07:15'),(150,'HW001','user3',5,'种类齐全，质量好，家用必备！','2026-05-23 09:07:15'),(151,'HW001','user2',4,'做工精细，耐用性强','2026-05-26 09:07:15'),(152,'HW001','admin2',5,'性价比很高，非常满意！','2026-05-25 09:07:15'),(153,'HW002','user1',5,'动力强劲，操作简单，很实用！','2026-05-22 09:07:15'),(154,'HW002','admin',4,'噪音小，续航时间长','2026-05-25 09:07:15'),(155,'HW003','user3',4,'重量适中，握感舒适，质量好','2026-05-21 09:07:15'),(156,'HW003','user2',5,'结实耐用，性价比不错！','2026-05-24 09:07:15'),(157,'HW003','admin2',4,'做工精细，家用很合适','2026-05-26 09:07:15'),(158,'BA001','admin',4,'很可爱','2026-05-29 23:47:20'),(159,'P001','admin',4,'可以可以','2026-05-30 00:15:08');
/*!40000 ALTER TABLE `product_reviews` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `products` (
  `id` varchar(50) NOT NULL COMMENT '商品ID',
  `name` varchar(100) NOT NULL COMMENT '商品名称',
  `category` varchar(50) NOT NULL COMMENT '商品分类',
  `icon` varchar(10) DEFAULT NULL COMMENT '商品图标(Emoji)',
  `price` decimal(10,2) NOT NULL COMMENT '商品价格',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_category` (`category`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` (`id`, `name`, `category`, `icon`, `price`, `created_at`, `updated_at`) VALUES ('B001','编程书籍','book','📚',79.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('B002','小说','book','📖',45.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('B003','文具套装','book','✏️',39.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BA001','玩具熊','baby','🧸',89.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BA002','奶瓶','baby','🍼',69.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BA003','婴儿服装','baby','👶',99.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BE001','口红','beauty','💄',199.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BE002','护肤品','beauty','🧴',299.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('BE003','指甲油','beauty','💅',59.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('C001','笔记本电脑','computer','💻',4599.00,'2026-05-22 04:43:04','2026-05-28 09:02:42'),('C002','27寸4K显示器','computer','🖥️',1899.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('C003','机械键盘','computer','⌨️',399.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('CL001','T恤','clothes','👕',99.00,'2026-05-22 04:43:04','2026-05-28 09:02:42'),('CL002','牛仔裤','clothes','👖',199.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('CL003','运动鞋','clothes','👟',399.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('F001','苹果','food','🍎',29.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('F002','面包','food','🍞',15.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('F003','咖啡','food','☕',68.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('H001','沙发','home','🛋️',2899.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('H002','床垫','home','🛏️',1599.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('H003','智能灯','home','💡',199.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('HW001','扳手套装','hardware','🔧',129.00,'2026-05-22 04:43:04','2026-05-24 04:52:42'),('HW002','电钻','hardware','🪚',399.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('HW003','锤子','hardware','🔨',49.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('P001','智能手机','phone','📱',2999.00,'2026-05-22 04:43:04','2026-05-24 04:47:29'),('P002','5G手机','phone','📲',3599.00,'2026-05-22 04:43:04','2026-05-24 04:52:42'),('P003','充电宝','phone','🔋',99.00,'2026-05-22 04:43:04','2026-05-24 04:52:42'),('S001','足球','sport','⚽',129.00,'2026-05-22 04:43:04','2026-05-22 04:43:04'),('S002','篮球','sport','🏀',149.00,'2026-05-22 04:43:04','2026-05-24 04:52:42'),('S003','哑铃','sport','🏋️',199.00,'2026-05-22 04:43:04','2026-05-22 04:43:04');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '自增ID',
  `username` varchar(50) NOT NULL COMMENT '用户名',
  `password` varchar(100) NOT NULL COMMENT '密码',
  `role` varchar(20) NOT NULL DEFAULT 'customer' COMMENT '角色: customer或admin',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  KEY `idx_username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `username`, `password`, `role`, `created_at`) VALUES (1,'admin','123456','customer','2026-05-21 08:23:15'),(2,'admin2','123456','admin','2026-05-21 08:23:15'),(3,'user3','123456','customer','2026-05-23 02:11:15');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-30  8:38:20
